In [1]:
import pandas as pd

In [4]:
df = pd.DataFrame({
    'country': ['France', 'USA', 'Ukraine'],
    'capital': ['Paris', 'Washington', 'Kyiv'],
    'population': [66.99, 328.2, 41.98]})
df

   country     capital  population
0   France       Paris       66.99
1      USA  Washington      328.20
2  Ukraine        Kyiv       41.98

In [6]:
df2 = pd.DataFrame({
    'country': ['France', 'USA', 'Ukraine'],
    'capital': ['Paris', 'Washington', 'Kyiv'],
    'population': [66.99, 328.2, 41.98]}, index=['FR', 'US', 'UA'])
df2

    country     capital  population
FR   France       Paris       66.99
US      USA  Washington      328.20
UA  Ukraine        Kyiv       41.98

Варианті получения значений

In [8]:
df2['capital']['US']

'Washington'

In [10]:
df2.capital.US

'Washington'

In [11]:
df2.capital['US']

'Washington'

In [12]:
df2.at['US', 'capital']

'Washington'

In [14]:
df2.iat[1, 1]

'Washington'

In [16]:
df2.loc['US']

country              USA
capital       Washington
population         328.2
Name: US, dtype: object

In [18]:
df2.loc['US', 'capital']

'Washington'

In [19]:
df2.iloc[1]

country              USA
capital       Washington
population         328.2
Name: US, dtype: object

In [21]:
df2.iloc[1, 1]

'Washington'

In [22]:
df.columns

Index(['country', 'capital', 'population'], dtype='object')

ЧТЕНИЕ ДАННЫХ

In [37]:
txt_df = pd.read_csv('test.txt', names=['id', 'city', 'population'], encoding='utf-8')
txt_df

   id      city  population
0   1     Кабул     1780000
1   2  Кандагар      237500

In [42]:
cities = pd.read_csv('city.csv', sep=';', names=['id', 'city', 'code', 'district', 'population'], header=0)
cities

        id            city code       district  population
0        1           Kabul  AFG          Kabol     1780000
1        2        Qandahar  AFG       Qandahar      237500
2        3           Herat  AFG          Herat      186800
3        4  Mazar-e-Sharif  AFG          Balkh      127800
4        5       Amsterdam  NLD  Noord-Holland      731200
...    ...             ...  ...            ...         ...
4074  4075      Khan Yunis  PSE     Khan Yunis      123175
4075  4076          Hebron  PSE         Hebron      119401
4076  4077        Jabaliya  PSE     North Gaza      113901
4077  4078          Nablus  PSE         Nablus      100231
4078  4079           Rafah  PSE          Rafah       92020

[4079 rows x 5 columns]

In [45]:
wiki_df = pd.read_html('https://uk.wikipedia.org/wiki/%D0%A1%D1%82%D0%B0%D1%82%D0%B8%D1%81%D1%82%D0%B8%D0%BA%D0%B0_%D1%82%D0%B0_%D1%80%D0%B5%D0%BA%D0%BE%D1%80%D0%B4%D0%B8_%D1%84%D1%83%D1%82%D0%B1%D0%BE%D0%BB%D1%8C%D0%BD%D0%B8%D1%85_%D0%BA%D0%BB%D1%83%D0%B1%D0%BD%D0%B8%D1%85_%D1%82%D1%83%D1%80%D0%BD%D1%96%D1%80%D1%96%D0%B2_%D0%A3%D0%84%D0%A4%D0%90')
wiki_df

AttributeError: module 'pandas' has no attribute 'read_lxml'

In [46]:
pd.read_json('https://jsonplaceholder.typicode.com/posts')

,userId,id,title,body
0,1,1,sunt aut facere repellat provident occaecati e...,quia et suscipit\nsuscipit recusandae consequu...
1,1,2,qui est esse,est rerum tempore vitae\nsequi sint nihil repr...
2,1,3,ea molestias quasi exercitationem repellat qui...,et iusto sed quo iure\nvoluptatem occaecati om...
3,1,4,eum et est occaecati,ullam et saepe reiciendis voluptatem adipisci\...
4,1,5,nesciunt quas odio,repudiandae veniam quaerat sunt sed\nalias aut...
...,...,...,...,...
95,10,96,quaerat velit veniam amet cupiditate aut numqu...,in non odio excepturi sint eum\nlabore volupta...
96,10,97,quas fugiat ut perspiciatis vero provident,eum non blanditiis soluta porro quibusdam volu...
97,10,98,laboriosam dolor voluptates,doloremque ex facilis sit sint culpa\nsoluta a...
98,10,99,temporibus sit alias delectus eligendi possimu...,quo deleniti praesentium dicta non quod\naut e...
99,10,100,at nam consequatur ea labore ea harum,cupiditate quo est a modi nesciunt soluta\nips...

In [47]:
pd.read_json('https://jsonplaceholder.typicode.com/users')

,id,name,username,email,address,phone,website,company
0,1,Leanne Graham,Bret,Sincere@april.biz,"{'street': 'Kulas Light', 'suite': 'Apt. 556',...",1-770-736-8031 x56442,hildegard.org,"{'name': 'Romaguera-Crona', 'catchPhrase': 'Mu..."
1,2,Ervin Howell,Antonette,Shanna@melissa.tv,"{'street': 'Victor Plains', 'suite': 'Suite 87...",010-692-6593 x09125,anastasia.net,"{'name': 'Deckow-Crist', 'catchPhrase': 'Proac..."
2,3,Clementine Bauch,Samantha,Nathan@yesenia.net,"{'street': 'Douglas Extension', 'suite': 'Suit...",1-463-123-4447,ramiro.info,"{'name': 'Romaguera-Jacobson', 'catchPhrase': ..."
3,4,Patricia Lebsack,Karianne,Julianne.OConner@kory.org,"{'street': 'Hoeger Mall', 'suite': 'Apt. 692',...",493-170-9623 x156,kale.biz,"{'name': 'Robel-Corkery', 'catchPhrase': 'Mult..."
4,5,Chelsey Dietrich,Kamren,Lucio_Hettinger@annie.ca,"{'street': 'Skiles Walks', 'suite': 'Suite 351...",(254)954-1289,demarco.info,"{'name': 'Keebler LLC', 'catchPhrase': 'User-c..."
5,6,Mrs. Dennis Schulist,Leopoldo_Corkery,Karley_Dach@jasper.info,"{'street': 'Norberto Crossing', 'suite': 'Apt....",1-477-935-8478 x6430,ola.org,"{'name': 'Considine-Lockman', 'catchPhrase': '..."
6,7,Kurtis Weissnat,Elwyn.Skiles,Telly.Hoeger@billy.biz,"{'street': 'Rex Trail', 'suite': 'Suite 280', ...",210.067.6132,elvis.io,"{'name': 'Johns Group', 'catchPhrase': 'Config..."
7,8,Nicholas Runolfsdottir V,Maxime_Nienow,Sherwood@rosamond.me,"{'street': 'Ellsworth Summit', 'suite': 'Suite...",586.493.6943 x140,jacynthe.com,"{'name': 'Abernathy Group', 'catchPhrase': 'Im..."
8,9,Glenna Reichert,Delphine,Chaim_McDermott@dana.io,"{'street': 'Dayna Park', 'suite': 'Suite 449',...",(775)976-6794 x41206,conrad.com,"{'name': 'Yost and Sons', 'catchPhrase': 'Swit..."
9,10,Clementina DuBuque,Moriah.Stanton,Rey.Padberg@karina.biz,"{'street': 'Kattie Turnpike', 'suite': 'Suite ...",024-648-3804,ambrose.net,"{'name': 'Hoeger LLC', 'catchPhrase': 'Central..."

In [48]:
df = pd.read_csv('city.csv', sep=';')
df

        ID            Name CountryCode       District  Population
0        1           Kabul         AFG          Kabol     1780000
1        2        Qandahar         AFG       Qandahar      237500
2        3           Herat         AFG          Herat      186800
3        4  Mazar-e-Sharif         AFG          Balkh      127800
4        5       Amsterdam         NLD  Noord-Holland      731200
...    ...             ...         ...            ...         ...
4074  4075      Khan Yunis         PSE     Khan Yunis      123175
4075  4076          Hebron         PSE         Hebron      119401
4076  4077        Jabaliya         PSE     North Gaza      113901
4077  4078          Nablus         PSE         Nablus      100231
4078  4079           Rafah         PSE          Rafah       92020

[4079 rows x 5 columns]

In [49]:
df.head()

   ID            Name CountryCode       District  Population
0   1           Kabul         AFG          Kabol     1780000
1   2        Qandahar         AFG       Qandahar      237500
2   3           Herat         AFG          Herat      186800
3   4  Mazar-e-Sharif         AFG          Balkh      127800
4   5       Amsterdam         NLD  Noord-Holland      731200

In [50]:
df.head(10)

   ID            Name CountryCode       District  Population
0   1           Kabul         AFG          Kabol     1780000
1   2        Qandahar         AFG       Qandahar      237500
2   3           Herat         AFG          Herat      186800
3   4  Mazar-e-Sharif         AFG          Balkh      127800
4   5       Amsterdam         NLD  Noord-Holland      731200
5   6       Rotterdam         NLD   Zuid-Holland      593321
6   7            Haag         NLD   Zuid-Holland      440900
7   8         Utrecht         NLD        Utrecht      234323
8   9       Eindhoven         NLD  Noord-Brabant      201843
9  10         Tilburg         NLD  Noord-Brabant      193238

In [51]:
df.tail()

        ID        Name CountryCode    District  Population
4074  4075  Khan Yunis         PSE  Khan Yunis      123175
4075  4076      Hebron         PSE      Hebron      119401
4076  4077    Jabaliya         PSE  North Gaza      113901
4077  4078      Nablus         PSE      Nablus      100231
4078  4079       Rafah         PSE       Rafah       92020

In [52]:
len(df)

4079

In [54]:
df.shape

(4079, 5)

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4079 entries, 0 to 4078
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ID           4079 non-null   int64
 1   Name         4079 non-null   object
 2   CountryCode  4079 non-null   object
 3   District     4075 non-null   object
 4   Population   4079 non-null   int64
dtypes: int64(2), object(3)
memory usage: 159.5+ KB

In [56]:
df[df['District'].isna()]

        ID           Name CountryCode District  Population
3284  3285        Taiping         TWN      NaN      165524
3292  3293         Taliao         TWN      NaN      115897
3293  3294       Kueishan         TWN      NaN      112195
3562  3563  Ciudad Losada         VEN      NaN      134501

In [57]:
df.describe()

                ID    Population
count  4079.000000  4.079000e+03
mean   2040.000000  3.504682e+05
std    1177.650203  7.237757e+05
min       1.000000  4.200000e+01
25%    1020.500000  1.147890e+05
50%    2040.000000  1.670510e+05
75%    3059.500000  3.106385e+05
max    4079.000000  1.050000e+07

In [58]:
df.CountryCode.unique()

array(['AFG', 'NLD', 'ANT', 'ALB', 'DZA', 'ASM', 'AND', 'AGO', 'AIA',
       'ATG', 'ARE', 'ARG', 'ARM', 'ABW', 'AUS', 'AZE', 'BHS', 'BHR',
       'BGD', 'BRB', 'BEL', 'BLZ', 'BEN', 'BMU', 'BTN', 'BOL', 'BIH',
       'BWA', 'BRA', 'GBR', 'VGB', 'BRN', 'BGR', 'BFA', 'BDI', 'CYM',
       'CHL', 'COK', 'CRI', 'DJI', 'DMA', 'DOM', 'ECU', 'EGY', 'SLV',
       'ERI', 'ESP', 'ZAF', 'ETH', 'FLK', 'FJI', 'PHL', 'FRO', 'GAB',
       'GMB', 'GEO', 'GHA', 'GIB', 'GRD', 'GRL', 'GLP', 'GUM', 'GTM',
       'GIN', 'GNB', 'GUY', 'HTI', 'HND', 'HKG', 'SJM', 'IDN', 'IND',
       'IRQ', 'IRN', 'IRL', 'ISL', 'ISR', 'ITA', 'TMP', 'AUT', 'JAM',
       'JPN', 'YEM', 'JOR', 'CXR', 'YUG', 'KHM', 'CMR', 'CAN', 'CPV',
       'KAZ', 'KEN', 'CAF', 'CHN', 'KGZ', 'KIR', 'COL', 'COM', 'COG',
       'COD', 'CCK', 'PRK', 'KOR', 'GRC', 'HRV', 'CUB', 'KWT', 'CYP',
       'LAO', 'LVA', 'LSO', 'LBN', 'LBR', 'LBY', 'LIE', 'LTU', 'LUX',
       'ESH', 'MAC', 'MDG', 'MKD', 'MWI', 'MDV', 'MYS', 'MLI', 'MLT',
       'MAR', 'MHL', 'MTQ', 'MRT', 'MUS', 'MYT', 'MEX', 'FSM', 'MDA',
       'MCO', 'MNG', 'MSR', 'MOZ', 'MMR', 'NAM', 'NRU', 'NPL', 'NIC',
       'NER', 'NGA', 'NIU', 'NFK', 'NOR', 'CIV', 'OMN', 'PAK', 'PLW',
       'PAN', 'PNG', 'PRY', 'PER', 'PCN', 'MNP', 'PRT', 'PRI', 'POL',
       'GNQ', 'QAT', 'FRA', 'GUF', 'PYF', 'REU', 'ROM', 'RWA', 'SWE',
       'SHN', 'KNA', 'LCA', 'VCT', 'SPM', 'DEU', 'SLB', 'ZMB', 'WSM',
       'SMR', 'STP', 'SAU', 'SEN', 'SYC', 'SLE', 'SGP', 'SVK', 'SVN',
       'SOM', 'LKA', 'SDN', 'FIN', 'SUR', 'SWZ', 'CHE', 'SYR', 'TJK',
       'TWN', 'TZA', 'DNK', 'THA', 'TGO', 'TKL', 'TON', 'TTO', 'TCD',
       'CZE', 'TUN', 'TUR', 'TKM', 'TCA', 'TUV', 'UGA', 'UKR', 'HUN',
       'URY', 'NCL', 'NZL', 'UZB', 'BLR', 'WLF', 'VUT', 'VAT', 'VEN',
       'RUS', 'VNM', 'EST', 'USA', 'VIR', 'ZWE', 'PSE'], dtype=object)

In [60]:
# len(df.CountryCode.unique())
df.CountryCode.unique().size

232

In [61]:
df.values

array([[1, 'Kabul', 'AFG', 'Kabol', 1780000],
       [2, 'Qandahar', 'AFG', 'Qandahar', 237500],
       [3, 'Herat', 'AFG', 'Herat', 186800],
       ...,
       [4077, 'Jabaliya', 'PSE', 'North Gaza', 113901],
       [4078, 'Nablus', 'PSE', 'Nablus', 100231],
       [4079, 'Rafah', 'PSE', 'Rafah', 92020]], dtype=object)

In [62]:
df.index

RangeIndex(start=0, stop=4079, step=1)

In [63]:
df.columns

Index(['ID', 'Name', 'CountryCode', 'District', 'Population'], dtype='object')

ПОДСЧЕТ С ГРУППИРОВКОЙ И СОРТИРОВКОЙ

In [64]:
df.CountryCode.value_counts()

CountryCode
CHN    363
IND    341
USA    274
BRA    250
JPN    248
      ...
URY      1
NCL      1
VUT      1
WLF      1
VIR      1
Name: count, Length: 232, dtype: int64

In [66]:
df.CountryCode.value_counts(normalize=True)

CountryCode
CHN    0.088992
IND    0.083599
USA    0.067173
BRA    0.061290
JPN    0.060799
         ...
URY    0.000245
NCL    0.000245
VUT    0.000245
WLF    0.000245
VIR    0.000245
Name: proportion, Length: 232, dtype: float64

In [67]:
pd.get_option('display.max_rows')

60

In [70]:
df_goods = pd.read_csv('D:\PythonProject\webformyself\price.csv', sep=';')
df_goods

<>:1: SyntaxWarning: invalid escape sequence '\P'
<>:1: SyntaxWarning: invalid escape sequence '\P'
C:\Users\Yevheniia\AppData\Local\Temp\ipykernel_10308\2931486362.py:1: SyntaxWarning: invalid escape sequence '\P'
  df_goods = pd.read_csv('D:\PythonProject\webformyself\price.csv', sep=';')

    id                                              title   price
0    1  Ноутбук Acer Aspire 5 A515-54G-502N (NX.HVGEU....  10.000
1    2  Ноутбук Asus ROG Strix G15 G512LI-HN057 (90NR0...     NaN
2    3  Ноутбук HP Pavilion Gaming 15-bc504ur (7DT87EA...   7.999
3    4  Ноутбук HP Pavilion Notebook 15-cw1011ua (8RW1...  25.000
4    5  Ноутбук Acer Aspire 7 A715-41G-R7MZ (NH.Q8LEU....  35.000
5    6  Ноутбук Dell Inspiron 3582 (I3582C54H5NIL-BK) ...   5.000
6    7  Ноутбук Apple MacBook Air 13" 256GB 2020 Space...  11.000
7    8  Ноутбук Asus ROG Strix G15 G512LI-HN094 (90NR0...  16.000
8    9  Ноутбук HP Pavilion Notebook 15-cw1002ua (7KE5...  15.000
9   10  Ноутбук HP Pavilion Notebook 15-cw1005ua (7ZF7...     NaN
10  11  Ноутбук Lenovo IdeaPad L340-15IRH Gaming (81LK...  10.000

In [71]:
pd.get_option('max_colwidth')

50

In [72]:
pd.set_option('max_colwidth', 70)

In [73]:
df_goods = pd.read_csv('D:\PythonProject\webformyself\price.csv', sep=';')
df_goods

<>:1: SyntaxWarning: invalid escape sequence '\P'
<>:1: SyntaxWarning: invalid escape sequence '\P'
C:\Users\Yevheniia\AppData\Local\Temp\ipykernel_10308\2931486362.py:1: SyntaxWarning: invalid escape sequence '\P'
  df_goods = pd.read_csv('D:\PythonProject\webformyself\price.csv', sep=';')

,id,title,price
0,1,Ноутбук Acer Aspire 5 A515-54G-502N (NX.HVGEU.006) Pure Silver,10.000
1,2,Ноутбук Asus ROG Strix G15 G512LI-HN057 (90NR0381-M01640) Black,NaN
2,3,Ноутбук HP Pavilion Gaming 15-bc504ur (7DT87EA) Black Суперцена!!!,7.999
3,4,Ноутбук HP Pavilion Notebook 15-cw1011ua (8RW14EA) Mineral Silver,25.000
4,5,Ноутбук Acer Aspire 7 A715-41G-R7MZ (NH.Q8LEU.004) Charcoal Black,35.000
5,6,Ноутбук Dell Inspiron 3582 (I3582C54H5NIL-BK) Black,5.000
6,7,"Ноутбук Apple MacBook Air 13"" 256GB 2020 Space Gray (MWTJ2)",11.000
7,8,Ноутбук Asus ROG Strix G15 G512LI-HN094 (90NR0381-M01620) Black,16.000
8,9,Ноутбук HP Pavilion Notebook 15-cw1002ua (7KE54EA) Mineral Silver ...,15.000
9,10,Ноутбук HP Pavilion Notebook 15-cw1005ua (7ZF75EA) Mineral Silver ...,NaN
10,11,Ноутбук Lenovo IdeaPad L340-15IRH Gaming (81LK01HCRA) Granite Black,10.000

In [77]:
pd.set_option('display.precision', 2)

In [78]:
df_goods = pd.read_csv('D:\PythonProject\webformyself\price.csv', sep=';')
df_goods

<>:1: SyntaxWarning: invalid escape sequence '\P'
<>:1: SyntaxWarning: invalid escape sequence '\P'
C:\Users\Yevheniia\AppData\Local\Temp\ipykernel_10308\2931486362.py:1: SyntaxWarning: invalid escape sequence '\P'
  df_goods = pd.read_csv('D:\PythonProject\webformyself\price.csv', sep=';')

,id,title,price
0,1,Ноутбук Acer Aspire 5 A515-54G-502N (NX.HVGEU.006) Pure Silver,10.0
1,2,Ноутбук Asus ROG Strix G15 G512LI-HN057 (90NR0381-M01640) Black,NaN
2,3,Ноутбук HP Pavilion Gaming 15-bc504ur (7DT87EA) Black Суперцена!!!,8.0
3,4,Ноутбук HP Pavilion Notebook 15-cw1011ua (8RW14EA) Mineral Silver,25.0
4,5,Ноутбук Acer Aspire 7 A715-41G-R7MZ (NH.Q8LEU.004) Charcoal Black,35.0
5,6,Ноутбук Dell Inspiron 3582 (I3582C54H5NIL-BK) Black,5.0
6,7,"Ноутбук Apple MacBook Air 13"" 256GB 2020 Space Gray (MWTJ2)",11.0
7,8,Ноутбук Asus ROG Strix G15 G512LI-HN094 (90NR0381-M01620) Black,16.0
8,9,Ноутбук HP Pavilion Notebook 15-cw1002ua (7KE54EA) Mineral Silver ...,15.0
9,10,Ноутбук HP Pavilion Notebook 15-cw1005ua (7ZF75EA) Mineral Silver ...,NaN
10,11,Ноутбук Lenovo IdeaPad L340-15IRH Gaming (81LK01HCRA) Granite Black,10.0

In [79]:
pd.get_option('display.max_columns')

20

In [81]:
pd.get_dummies(list(range(10)), prefix='column')

,column_0,column_1,column_2,column_3,column_4,column_5,column_6,column_7,column_8,column_9
0,True,False,False,False,False,False,False,False,False,False
1,False,True,False,False,False,False,False,False,False,False
2,False,False,True,False,False,False,False,False,False,False
3,False,False,False,True,False,False,False,False,False,False
4,False,False,False,False,True,False,False,False,False,False
5,False,False,False,False,False,True,False,False,False,False
6,False,False,False,False,False,False,True,False,False,False
7,False,False,False,False,False,False,False,True,False,False
8,False,False,False,False,False,False,False,False,True,False
9,False,False,False,False,False,False,False,False,False,True